hulei123/git123/apps/bus_pal/MKV46F15/dspi/hal/fsl_dspi_hal.c
    /* return the actual calculated baud rate*/
    return bestBaudrate;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetBaudDivisors
 * Description   : Configure the baud rate divisors manually.
 * This function allows the caller to manually set the baud rate divisors in the event that
 * these dividers are known and the caller does not wish to call the DSPI_HAL_SetBaudRate function.
 *
 *END**************************************************************************/
void DSPI_HAL_SetBaudDivisors(SPI_Type * baseAddr,
                              dspi_ctar_selection_t whichCtar,
                              const dspi_baud_rate_divisors_t * divisors)
{
    /* these settings are only relevant in master mode*/
    if (DSPI_HAL_IsMaster(baseAddr))
    {
        SPI_WR_CTAR_DBR(baseAddr, whichCtar, divisors->doubleBaudRate);
        SPI_WR_CTAR_PBR(baseAddr, whichCtar, divisors->prescaleDivisor);
        SPI_WR_CTAR_BR(baseAddr, whichCtar, divisors->baudRateDivisor);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetPcsPolarityMode
 * Description   : Configure DSPI peripheral chip select polarity.
 * This function will take in the desired peripheral chip select (PCS) and it's
 * corresponding desired polarity and will configure the PCS signal to operate with the
 * desired characteristic.
 *
 *END**************************************************************************/
void DSPI_HAL_SetPcsPolarityMode(SPI_Type * baseAddr, dspi_which_pcs_config_t pcs,
                                 dspi_pcs_polarity_config_t activeLowOrHigh)
{
    uint32_t temp;

    temp = SPI_RD_MCR_PCSIS(baseAddr);

    if (activeLowOrHigh == kDspiPcs_ActiveLow)
    {
        temp |= pcs;
    }
    else  /* kDspiPcsPolarity_ActiveHigh*/
    {
        temp &= ~(unsigned)pcs;
    }

    SPI_WR_MCR_PCSIS(baseAddr, temp);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetFifoCmd
 * Description   : Enables (or disables) the DSPI FIFOs.
 * This function with allow the caller to disable/enable the TX and RX FIFOs (independently).
 * Note that to disable, the caller must pass in a logic 0 (false) for the particular FIFO
 * configuration.  To enable, the caller must pass in a logic 1 (true).
 *
 *END**************************************************************************/
void DSPI_HAL_SetFifoCmd(SPI_Type * baseAddr, bool enableTxFifo, bool enableRxFifo)
{
    /* first see if MDIS is set or cleared */
    uint32_t isMdisSet = SPI_RD_MCR_MDIS(baseAddr);

    if (isMdisSet)
    {
        /* clear the MDIS bit (enable DSPI) to allow us to write to the fifo disables */
        DSPI_HAL_Enable(baseAddr);
    }

    /* Note, the bit definition is "disable FIFO", so a "1" would disable. If user wants to enable
     * the FIFOs, they pass in true, which we must logically negate (turn to false) to enable the
     * FIFO
     */
    SPI_WR_MCR_DIS_TXF(baseAddr, ~(enableTxFifo == true));
    SPI_WR_MCR_DIS_RXF(baseAddr, ~(enableRxFifo == true));

    /* set MDIS (disable DSPI) if it was set to begin with */
    if (isMdisSet)
    {
        DSPI_HAL_Disable(baseAddr);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetFlushFifoCmd
 * Description   : Flush DSPI fifos.
 *
 *END**************************************************************************/
void DSPI_HAL_SetFlushFifoCmd(SPI_Type * baseAddr, bool enableFlushTxFifo, bool enableFlushRxFifo)
{
    SPI_WR_MCR_CLR_TXF(baseAddr, (enableFlushTxFifo == true));
    SPI_WR_MCR_CLR_RXF(baseAddr, (enableFlushRxFifo == true));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetDataFormat
 * Description   : Configure the data format for a particular CTAR.
 * This function configures the bits-per-frame, polarity, phase, and shift direction for a
 * particular CTAR. An example use case is as follows:
 *    dspi_data_format_config_t dataFormat;
 *    dataFormat.bitsPerFrame = 16;
 *    dataFormat.clkPolarity = kDspiClockPolarity_ActiveLow;
 *    dataFormat.clkPhase = kDspiClockPhase_FirstEdge;
 *    dataFormat.direction = kDspiMsbFirst;
 *    DSPI_HAL_SetDataFormat(baseAddr, kDspiCtar0, &dataFormat);
 *
 *END**************************************************************************/
dspi_status_t DSPI_HAL_SetDataFormat(SPI_Type * baseAddr,
                                     dspi_ctar_selection_t whichCtar,
                                     const dspi_data_format_config_t * config)
{
    /* check bits-per-frame value to make sure it it within the proper range*/
    /* in either master or slave mode*/
    if ((config->bitsPerFrame < 4) ||
        ((config->bitsPerFrame > 16) && (SPI_RD_MCR(baseAddr) == 1)) ||
        ((config->bitsPerFrame > 32) && (SPI_RD_MCR(baseAddr) == 0)))
    {
        return kStatus_DSPI_InvalidBitCount;
    }

    /* for master mode configuration*/
    if (DSPI_HAL_IsMaster(baseAddr))
    {
        SPI_WR_CTAR_FMSZ(baseAddr, whichCtar, (config->bitsPerFrame - 1));
        SPI_WR_CTAR_CPOL(baseAddr, whichCtar, config->clkPolarity);
        SPI_WR_CTAR_CPHA(baseAddr, whichCtar, config->clkPhase);
        SPI_WR_CTAR_LSBFE(baseAddr, whichCtar, config->direction);
    }
    else /* for slave mode configuration*/
    {
        SPI_WR_CTAR_SLAVE_FMSZ(baseAddr, whichCtar, (config->bitsPerFrame - 1));
        SPI_WR_CTAR_SLAVE_CPOL(baseAddr, whichCtar, config->clkPolarity);
        SPI_WR_CTAR_SLAVE_CPHA(baseAddr, whichCtar, config->clkPhase);
    }
    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetDelay
 * Description   : Manually configures the delay prescaler and scaler for a particular CTAR.
 * This function configures the:
 * PCS to SCK delay pre-scalar (PCSSCK) and scalar (CSSCK),
 * After SCK delay pre-scalar (PASC) and scalar (ASC),
 * Delay after transfer pre-scalar (PDT)and scalar (DT).
 *
 * These delay names are available in type dspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the prescaler and scaler value.
 * This basically allows the user to directly set the prescaler/scaler values if they have
 * pre-calculated them or if they simply wish to manually increment either value.
 *END**************************************************************************/
void DSPI_HAL_SetDelay(SPI_Type * baseAddr, dspi_ctar_selection_t whichCtar, uint32_t prescaler,
                       uint32_t scaler, dspi_delay_type_t whichDelay)
{
    /* these settings are only relevant in master mode*/
    if (DSPI_HAL_IsMaster(baseAddr))
    {
        if (whichDelay == kDspiPcsToSck)
        {
            SPI_WR_CTAR_PCSSCK(baseAddr, whichCtar, prescaler);
            SPI_WR_CTAR_CSSCK(baseAddr, whichCtar, scaler);
        }

        if (whichDelay == kDspiLastSckToPcs)
        {
            SPI_WR_CTAR_PASC(baseAddr, whichCtar, prescaler);
            SPI_WR_CTAR_ASC(baseAddr, whichCtar, scaler);
        }

        if (whichDelay == kDspiAfterTransfer)
        {
            SPI_WR_CTAR_PDT(baseAddr, whichCtar, prescaler);
            SPI_WR_CTAR_DT(baseAddr, whichCtar, scaler);
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_CalculateDelay
 * Description   : Calculates the delay prescaler and scaler based on desired delay input in
 *                 nano-seconds.
 *
 * This function calculates the values for:
 * PCS to SCK delay pre-scalar (PCSSCK) and scalar (CSSCK), or
 * After SCK delay pre-scalar (PASC) and scalar (ASC), or
 * Delay after transfer pre-scalar (PDT)and scalar (DT).
 *
 * These delay names are available in type dspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the desired delay value in
 * nano-seconds.  The function will calculate the values needed for the prescaler and scaler and
 * will return the actual calculated delay as an exact delay match may not be acheivable. In this
 * case, the closest match will be calculated without going below the desired delay value input.
 * It is possible to input a very large delay value that exceeds the capability of the part, in
 * which case the maximum supported delay will be returned. It will be up to the higher level
 * peripheral driver to alert the user of an out of range delay input.
 *END**************************************************************************/
uint32_t DSPI_HAL_CalculateDelay(SPI_Type * baseAddr, dspi_ctar_selection_t whichCtar,
                                 dspi_delay_type_t whichDelay, uint32_t sourceClockInHz,
                                 uint32_t delayInNanoSec)
{
    /* for master mode configuration, if slave mode detected, return 0*/
    if (!DSPI_HAL_IsMaster(baseAddr))
    {
        return 0;
    }

    uint32_t prescaler, bestPrescaler;
    uint32_t scaler, bestScaler;
    uint32_t realDelay, bestDelay;
    uint32_t diff, min_diff;
    uint32_t initialDelayNanoSec;

