hulei123/git123/apps/bus_pal/MKV46F15/dspi/hal/fsl_dspi_hal.c
    /* find combination of prescaler and scaler resulting in the delay closest to the
     * requested value
     */
    min_diff = 0xFFFFFFFFU;
    /* Initialize prescaler and scaler to their max values to generate the max delay */
    bestPrescaler = 0x3;
    bestScaler = 0xF;
    bestDelay = (1000000000/sourceClockInHz) * s_delayPrescaler[bestPrescaler] *
                 s_delayScaler[bestScaler];

    /* First calculate the initial, default delay */
    initialDelayNanoSec = 1000000000/sourceClockInHz * 2;

    /* If the initial, default delay is already greater than the desired delay, then
     * set the delays to their initial value (0) and return the delay. In other words,
     * there is no way to decrease the delay value further.
     */
    if (initialDelayNanoSec >= delayInNanoSec)
    {
        DSPI_HAL_SetDelay(baseAddr, whichCtar, 0, 0, whichDelay);
        return initialDelayNanoSec;
    }


    /* In all for loops, if min_diff = 0, the exit for loop*/
    for (prescaler = 0; (prescaler < 4) && min_diff; prescaler++)
    {
        for (scaler = 0; (scaler < 16) && min_diff; scaler++)
        {
            realDelay = (1000000000/sourceClockInHz) * s_delayPrescaler[prescaler] *
                         s_delayScaler[scaler];

            /* calculate the delay difference based on the conditional statement
             * that states that the calculated delay must not be less then the desired delay
             */
            if (realDelay >= delayInNanoSec)
            {
                diff = realDelay-delayInNanoSec;
                if (min_diff > diff)
                {
                    /* a better match found */
                    min_diff = diff;
                    bestPrescaler = prescaler;
                    bestScaler = scaler;
                    bestDelay = realDelay;
                }
            }
        }
    }

    /* write the best dbr, prescalar, and baud rate scalar to the CTAR*/
    DSPI_HAL_SetDelay(baseAddr, whichCtar, bestPrescaler, bestScaler, whichDelay);

    /* return the actual calculated baud rate*/
    return bestDelay;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetTxFifoFillDmaIntMode
 * Description   : Configures the DSPI Tx FIFO Fill request to generate DMA or interrupt requests.
 * This function configures the DSPI Tx FIFO Fill flag to generate either
 * an interrupt or DMA request.  The user passes in which request they'd like to generate
 * of type dspi_dma_or_int_mode_t and whether or not they wish to enable this request.
 * Note, when disabling the request, the request type is don't care.
 *
 *  DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true); <- to enable DMA
 *  DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, true); <- to enable Interrupt
 *  DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, false); <- to disable
 *
 *END**************************************************************************/
void DSPI_HAL_SetTxFifoFillDmaIntMode(SPI_Type * baseAddr, dspi_dma_or_int_mode_t mode, bool enable)
{
    SPI_WR_RSER_TFFF_DIRS(baseAddr, mode);  /* Configure as DMA or interrupt */
    SPI_WR_RSER_TFFF_RE(baseAddr, (enable == true));  /* Enable or disable the request */
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetRxFifoDrainDmaIntMode
 * Description   : Configures the DSPI Rx FIFO Drain request to generate DMA or interrupt requests.
 * This function configures the DSPI Rx FIFO Drain flag to generate either
 * an interrupt or DMA request.  The user passes in which request they'd like to generate
 * of type dspi_dma_or_int_mode_t and whether or not they wish to enable this request.
 * Note, when disabling the request, the request type is don't care.
 *
 *  DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, true); <- to enable DMA
 *  DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, true); <- to enable Interrupt
 *  DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, false); <- to disable
 *
 *END**************************************************************************/
void DSPI_HAL_SetRxFifoDrainDmaIntMode(SPI_Type * baseAddr, dspi_dma_or_int_mode_t mode, bool enable)
{
    SPI_WR_RSER_RFDF_DIRS(baseAddr, mode);  /* Configure as DMA or interrupt */
    SPI_WR_RSER_RFDF_RE(baseAddr, (enable == true));  /* Enable or disable the request */
}


/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_SetIntMode
 * Description   : Configure DSPI interrupts.
 * This function configures the various interrupt sources of the DSPI.  The parameters are
 * baseAddr, interrupt source, and enable/disable setting.
 * The interrupt source is a typedef enum whose value is the bit position of the
 * interrupt source setting within the RSER register.  In the DSPI, all interrupt
 * configuration settings are in  one register.  The typedef enum  equates each
 * interrupt source to the bit position defined in the device header file.
 * The function  uses these bit positions in its algorithm to enable/disable the
 * interrupt source, where interrupt source is the dspi_status_and_interrupt_request_t type.
 * Note, for Tx FIFO Fill and Rx FIFO Drain requests, use the functions:
 * DSPI_HAL_SetTxFifoFillDmaIntMode and DSPI_HAL_SetRxFifoDrainDmaIntMode respectively as
 * these requests can generate either an interrupt or DMA request.
 *
 *   DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true); <- example use-case
 *
 *END**************************************************************************/
void DSPI_HAL_SetIntMode(SPI_Type * baseAddr,
                                  dspi_status_and_interrupt_request_t interruptSrc,
                                  bool enable)
{
    uint32_t temp;

    temp = (SPI_RD_RSER(baseAddr) & ~(0x1U << interruptSrc)) |
                          ((uint32_t)enable << interruptSrc);
    SPI_WR_RSER(baseAddr, temp);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_GetFifoData
 * Description   : Read fifo registers for debug purposes.
 *
 *END**************************************************************************/
// Macros need fixing
//uint32_t DSPI_HAL_GetFifoData(SPI_Type * baseAddr, dspi_fifo_t whichFifo, uint32_t whichFifoEntry)
//{
//    if (whichFifo == kDspiTxFifo)
//    {
//        return SPI_RD_TXFR(baseAddr, whichFifoEntry);
//    }
//    else
//    {
//        return SPI_RD_RXFR(baseAddr, whichFifoEntry);
//    }
//}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_WriteDataMastermode
 * Description   : Write data into the data buffer, master mode.
 * In master mode, the 16-bit data is appended with the 16-bit command info. The command portion
 * provides characteristics of the data being sent such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). An example use case is as follows:
 *    dspi_command_config_t commandConfig;
 *    commandConfig.isChipSelectContinuous = true;
 *    commandConfig.whichCtar = kDspiCtar0;
 *    commandConfig.whichPcs = kDspiPcs1;
 *    commandConfig.clearTransferCount = false;
 *    commandConfig.isEndOfQueue = false;
 *    DSPI_HAL_WriteDataMastermode(baseAddr, &commandConfig, dataWord);
 *
 *END**************************************************************************/
void DSPI_HAL_WriteDataMastermode(SPI_Type * baseAddr,
                                  dspi_command_config_t * command,
                                  uint16_t data)
{
    uint32_t temp;

    /* First, build up the 32-bit word then write it to the PUSHR */
    temp = SPI_PUSHR_CONT(command->isChipSelectContinuous) |
           SPI_PUSHR_CTAS(command->whichCtar) |
           SPI_PUSHR_PCS(command->whichPcs) |
           SPI_PUSHR_EOQ(command->isEndOfQueue) |
           SPI_PUSHR_CTCNT(command->clearTransferCount) |
           SPI_PUSHR_TXDATA(data);

