hulei123/git123/apps/bus_pal/MKV46F15/dspi/hal/fsl_dspi_hal.c
    SPI_WR_PUSHR(baseAddr, temp);
}

void DSPI_HAL_WriteDataSlavemodeBlocking(SPI_Type * baseAddr, uint32_t data)
{
    /* Firstly, clear transmit complete flag */
    SPI_WR_SR_TCF(baseAddr, 1);
    /* Write data into register */
    SPI_WR_PUSHR_SLAVE(baseAddr, data);
    /* Wait tills the data is transmitted */
    while(SPI_RD_SR_TCF(baseAddr) == 0) { }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_WriteDataMastermodeBlocking
 * Description   : Write data into the data buffer, master mode and waits till complete to return.
 * In master mode, the 16-bit data is appended with the 16-bit command info. The command portion
 * provides characteristics of the data being sent such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). An example use case is as follows:
 *    dspi_command_config_t commandConfig;
 *    commandConfig.isChipSelectContinuous = true;
 *    commandConfig.whichCtar = kDspiCtar0;
 *    commandConfig.whichPcs = kDspiPcs1;
 *    commandConfig.clearTransferCount = false;
 *    commandConfig.isEndOfQueue = false;
 *    DSPI_HAL_WriteDataMastermodeBlocking(baseAddr, &commandConfig, dataWord);
 *
 * Note that this function will not return until after the transmit is complete. Also note that
 * the DSPI must be enabled and running in order to transmit data (MCR[MDIS] & [HALT] = 0).
 * Since the SPI is a synchronous protocol, receive data will be available when transmit completes.
 *
 *END**************************************************************************/
void DSPI_HAL_WriteDataMastermodeBlocking(SPI_Type * baseAddr,
                                          dspi_command_config_t * command,
                                          uint16_t data)
{
    uint32_t temp;

    /* First, clear Transmit Complete Flag (TCF) */
    SPI_WR_SR_TCF(baseAddr, 1);

    /* First, build up the 32-bit word then write it to the PUSHR */
    temp = SPI_PUSHR_CONT(command->isChipSelectContinuous) |
           SPI_PUSHR_CTAS(command->whichCtar) |
           SPI_PUSHR_PCS(command->whichPcs) |
           SPI_PUSHR_EOQ(command->isEndOfQueue) |
           SPI_PUSHR_CTCNT(command->clearTransferCount) |
           SPI_PUSHR_TXDATA(data);

    SPI_WR_PUSHR(baseAddr, temp);

    /* Wait till TCF sets */
    while(SPI_RD_SR_TCF(baseAddr) == 0) { }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_WriteCmdDataMastermodeBlocking
 * Description   : Writes a 32-bit data word (16-bit command appended with 16-bit data) into the
 *                 data buffer, master mode and waits till complete to return.
 * In this function, the user must append the 16-bit data to the 16-bit command info then
 * provide the total 32-bit word as the data to send.
 * The command portion provides characteristics of the data such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). The user is responsible for appending this command
 * with the data to send.  This is an example:
 *
 *   dataWord = <16-bit command> | <16-bit data>;
 *   DSPI_HAL_WriteCmdDataMastermodeBlocking(baseAddr, dataWord);
 *
 *
 * Note that this function does not return until after the transmit is complete. Also note that
 * the DSPI must be enabled and running in order to transmit data (MCR[MDIS] & [HALT] = 0).
 * Since the SPI is a synchronous protocol, receive data is available when transmit completes.
 *
 *END**************************************************************************/
void DSPI_HAL_WriteCmdDataMastermodeBlocking(SPI_Type * baseAddr, uint32_t data)
{
    /* First, clear Transmit Complete Flag (TCF) */
    SPI_WR_SR_TCF(baseAddr, 1);

    SPI_WR_PUSHR(baseAddr, data);

    /* Wait till TCF sets */
    while(SPI_RD_SR_TCF(baseAddr) == 0) { }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_HAL_GetFormattedCommand
 * This function allows the caller to pass in the data command structure and returns the command
 * word formatted according to the DSPI PUSHR register bit field placement. The user can then
 * "OR" the returned command word with the desired data to send and use the function
 * DSPI_HAL_WriteCmdDataMastermode or DSPI_HAL_WriteCmdDataMastermodeBlocking to write the
 * entire 32-bit command data word to the PUSHR.
 * This helps improve performance in cases where the command structure is constant.
 * For example, the user calls this function before starting a transfer to generate the
 * command word.  When they are ready to transmit the data, they would OR this formatted command
 * word with the desired data to transmit.
 * This process increases transmit performance when compared to calling send functions such as
 * DSPI_HAL_WriteDataMastermode which format the command word each time a data word is
 * to be sent.
 *
 *END**************************************************************************/
uint32_t DSPI_HAL_GetFormattedCommand(SPI_Type * baseAddr, dspi_command_config_t * command)
{
    uint32_t temp;

    /* Format the 16-bit command word according to the PUSHR data register bit field */
    temp = SPI_PUSHR_CONT(command->isChipSelectContinuous) |
           SPI_PUSHR_CTAS(command->whichCtar) |
           SPI_PUSHR_PCS(command->whichPcs) |
           SPI_PUSHR_EOQ(command->isEndOfQueue) |
           SPI_PUSHR_CTCNT(command->clearTransferCount);

    return temp;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/

